package step.learning.treating;

public class TreadDemo {
    public  void run(){

    }
}
/*
* Многопоточность и асинхронность
* (А)Синхронность - распределение кода во времени
*  - синхронный код - код выполняется последовательно инструкция за инструкцией
*  - асинхронность - возможность в некоторых промежутках времени одновременного выполнения процессов
*
* Многопоточность - программирование с использованием системных объектов "поток"
*
* Многопроцессорность  - выполнение нескольких системных объектов "процесс"
*
* Grid , Network - технологии - использование узлов обеденных в сети
 * */